app/Controllers/Main.php

SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `designations`
SELECT COUNT(*) AS `numrows` FROM `employees`
SELECT COUNT(*) AS `numrows` FROM `payrolls`
---
    public function index()
    {
        $this->data['page_title']="Home";
        $this->data['departments']=$this->dept_model->countAll();
        $this->data['designations']=$this->desg_model->countAll();
        $this->data['employees']=$this->emp_model->countAll();
        $this->data['payrolls']=$this->payroll_model->countAll();

SELECT *
FROM `users`
WHERE `id` != '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '1'
---
    public function users(){
        $this->data['page_title']="Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `employees`
INNER JOIN `departments` ON `employees`.`department_id` = `departments`.`id`
INNER JOIN `designations` ON `employees`.`designation_id` = `designations`.`id`
SELECT `employees`.*, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`, CONCAT(departments.code, ' - ', departments.name) as department, CONCAT(designations.code, ' - ', designations.name) as designation
FROM `employees`
INNER JOIN `departments` ON `employees`.`department_id` = `departments`.`id`
INNER JOIN `designations` ON `employees`.`designation_id` = `designations`.`id`
 LIMIT 10
---
    public function employees(){
        $this->data['page_title']="Employees";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->emp_model->where(" employees.`code` like '%{$search}%' or employees.`first_name` like '%{$search}%' or employees.`middle_name` like '%{$search}%' or employees.`last_name` like '%{$search}%' or CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) like '%{$search}%'");
        }
        $this->data['total'] =  $this->emp_model->countAllResults();
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->emp_model->where(" employees.`code` like '%{$search}%' or employees.`first_name` like '%{$search}%' or employees.`middle_name` like '%{$search}%' or employees.`last_name` like '%{$search}%' or CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) like '%{$search}%'");
        }
        $this->data['employees'] = $this->emp_model
                                    ->select("employees.*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`, CONCAT(departments.code,' - ', departments.name) as department, CONCAT(designations.code,' - ', designations.name) as designation")
                                    ->join('departments'," employees.department_id = departments.id ",'inner')
                                    ->join('designations'," employees.designation_id = designations.id ",'inner')
                                    ->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `payrolls`
SELECT *
FROM `payrolls`
 LIMIT 10
---
    public function payrolls(){
        $this->data['page_title']="Payrolls";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->payroll_model->countAllResults();
        $this->data['payrolls'] = $this->payroll_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `payrolls`
WHERE `code` = 'test 2'
---
    public function payroll_add(){
        if($this->request->getMethod() == 'post'){
            extract($this->request->getPost());
            $udata= [];
            $udata['code'] = $code;
            $udata['title'] = $title;
            $udata['from_date'] = $from_date;
            $udata['to_date'] = $to_date;
            $checkCode = $this->payroll_model->where('code',$code)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `payslips`
SELECT COUNT(*) AS `numrows`
FROM `payslips`
INNER JOIN `payrolls` ON `payslips`.`payroll_id` = `payrolls`.`id`
INNER JOIN `employees` ON `payslips`.`employee_id` = `employees`.`id`
SELECT `payslips`.*, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `employee_name`, `employees`.`code` as `employee_code`, `payrolls`.`code` as `payroll_code`, `payrolls`.`title` as `payroll_name`
FROM `payslips`
INNER JOIN `payrolls` ON `payslips`.`payroll_id` = `payrolls`.`id`
INNER JOIN `employees` ON `payslips`.`employee_id` = `employees`.`id`
 LIMIT 10
---
    public function payslips(){
        $this->data['page_title']="Payslips";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->payslip_model->countAllResults();
        $this->data['payslips'] = $this->payslip_model
                                        ->select("`payslips`.*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `employee_name`, employees.code as employee_code, payrolls.code as payroll_code, payrolls.title as payroll_name")
                                        ->join('payrolls'," payslips.payroll_id = payrolls.id ",'inner')
                                        ->join('employees'," payslips.employee_id = employees.id ",'inner')
                                        ->paginate($this->data['perPage']);

SELECT *, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`
FROM `employees`
SELECT *
FROM `payrolls`
---
            }
        }

        $this->data['employees'] = $this->emp_model->select("*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`")->findAll();
        $this->data['payrolls'] = $this->payroll_model->findAll();

SELECT `payslips`.*, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`, `employees`.`code`, CONCAT(departments.code, ' - ', departments.name) as department, CONCAT(designations.code, ' - ', designations.name) as designation, `payrolls`.`code` as `payroll_code`, `payrolls`.`title` as `payroll_name`, `payslips`.`present`, `payslips`.`late_undertime`, `payslips`.`late_undertime_deduction`, `payslips`.`ot_rate`, `payslips`.`ot_hr`, `payslips`.`leg_rate`, `payslips`.`leg_hr`, `payslips`.`sp_rate`, `payslips`.`sp_hr`, `payslips`.`salary`
FROM `payslips`
INNER JOIN `payrolls` ON `payslips`.`payroll_id` = `payrolls`.`id`
INNER JOIN `employees` ON `payslips`.`employee_id` = `employees`.`id`
INNER JOIN `departments` ON `employees`.`department_id` = `departments`.`id`
INNER JOIN `designations` ON `employees`.`designation_id` = `designations`.`id`
LEFT JOIN `loans` ON `employees`.`id` = `loans`.`employee_id`
WHERE `payslips`.`id` = 42
 LIMIT 1
---
    public function payslip_view($id=''){
        if(empty($id)){
            $this->session->setFlashdata('main_error', "Payslip ID is unknown.");
            return redirect()->to('Main/payslips');
        }
        $this->data['page_title'] = "Payslip Details";
        $details = $this->payslip_model
            ->select("payslips.*,
                      CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`,
                      employees.code,
                      CONCAT(departments.code, ' - ', departments.name) as department,
                      CONCAT(designations.code, ' - ', designations.name) as designation,
                      payrolls.code as payroll_code,
                      payrolls.title as payroll_name,
                      payslips.present,
                      payslips.late_undertime,
                      payslips.late_undertime_deduction,
                      payslips.ot_rate,
                      payslips.ot_hr,
                      payslips.leg_rate,
                      payslips.leg_hr,
                      payslips.sp_rate,
                      payslips.sp_hr,
                      payslips.salary,")
            ->join('payrolls', "payslips.payroll_id = payrolls.id", 'inner')
            ->join('employees', "payslips.employee_id = employees.id", 'inner')
            ->join('departments', "employees.department_id = departments.id", 'inner')
            ->join('designations', "employees.designation_id = designations.id", 'inner')
            ->join('loans', "employees.id = loans.employee_id", 'left')
            ->where("payslips.id = $id")
            ->first();

SELECT COUNT(*) AS `numrows`
FROM `loans`
SELECT COUNT(*) AS `numrows`
FROM `loans`
INNER JOIN `employees` ON `loans`.`employee_id` = `employees`.`id`
SELECT `loans`.*, CONCAT(employees.last_name, ", ", `employees`.`first_name`, COALESCE(CONCAT(" ", employees.middle_name), "")) as employee_name
FROM `loans`
INNER JOIN `employees` ON `loans`.`employee_id` = `employees`.`id`
 LIMIT 10
SELECT *
FROM `employees`
---
    public function loans() {
        $this->data['page_title'] = "Loans";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] = 10;
        $this->data['total'] = $this->loan_model->countAllResults();

        $this->data['loans'] = $this->loan_model
                                    ->select('loans.*, CONCAT(employees.last_name, ", ", employees.first_name, COALESCE(CONCAT(" ", employees.middle_name), "")) as employee_name')
                                    ->join('employees', 'loans.employee_id = employees.id', 'inner')
                                    ->paginate($this->data['perPage']);


        $this->data['pager'] = $this->loan_model->pager;
        $this->data['employees'] = $this->emp_model->findAll();